; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_17_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 - counter
	)
  (:init
		(= (value c0) 16)
	(= (value c1) 71)
	(= (value c2) 76)
	(= (value c3) 36)
	(= (value c4) 52)
	(= (value c5) 23)
	(= (value c6) 23)
	(= (value c7) 71)
	(= (value c8) 74)
	(= (value c9) 10)
	(= (value c10) 81)
	(= (value c11) 32)
	(= (value c12) 52)
	(= (value c13) 13)
	(= (value c14) 53)
	(= (value c15) 96)
	(= (value c16) 51)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 9 of 16
2. (increment c6)
   changed: (value c6) from 23 to 24
   goals met: 10 of 16
3. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 10 of 16
4. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 10 of 16
5. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 10 of 16
6. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 10 of 16
7. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 10 of 16
8. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 10 of 16
9. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 10 of 16
10. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 10 of 16
11. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 10 of 16
12. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 10 of 16
13. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 10 of 16
14. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 10 of 16
15. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 10 of 16
16. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 10 of 16
17. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 10 of 16
18. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 10 of 16
19. (increment c13)
   changed: (value c13) from 13 to 18
   goals met: 10 of 16
20. (increment c13)
   changed: (value c13) from 18 to 23
   goals met: 10 of 16
21. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 10 of 16
22. (increment c13)
   changed: (value c13) from 23 to 29
   goals met: 10 of 16
23. (increment c13)
   changed: (value c13) from 29 to 35
   goals met: 10 of 16
24. (increment c13)
   changed: (value c13) from 35 to 41
   goals met: 10 of 16
25. (increment c13)
   changed: (value c13) from 41 to 47
   goals met: 10 of 16
26. (increment c13)
   changed: (value c13) from 47 to 53
   goals met: 10 of 16
27. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 10 of 16
28. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 10 of 16
29. (increment c3)
   changed: (value c3) from 36 to 43
   goals met: 10 of 16
30. (increment c3)
   changed: (value c3) from 43 to 50
   goals met: 10 of 16
31. (increment c3)
   changed: (value c3) from 50 to 57
   goals met: 9 of 16
32. (increment c3)
   changed: (value c3) from 57 to 64
   goals met: 9 of 16
33. (decrement c2)
   changed: (value c2) from 76 to 73
   goals met: 9 of 16
34. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 9 of 16
35. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 9 of 16
36. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 9 of 16
37. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 9 of 16
38. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 9 of 16
39. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 9 of 16
40. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 9 of 16
41. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 9 of 16
42. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 9 of 16
43. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 9 of 16
44. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 9 of 16
45. (decrement c13)
   changed: (value c13) from 53 to 47
   goals met: 9 of 16
46. (decrement c12)
   changed: (value c12) from 52 to 49
   goals met: 9 of 16
47. (decrement c12)
   changed: (value c12) from 49 to 46
   goals met: 10 of 16
48. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 10 of 16
49. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 10 of 16
50. (increase_rate c16)
   changed: (rate_value c16) from 2 to 3
   goals met: 10 of 16
51. (increase_rate c16)
   changed: (rate_value c16) from 3 to 4
   goals met: 10 of 16
52. (increase_rate c16)
   changed: (rate_value c16) from 4 to 5
   goals met: 10 of 16
53. (increase_rate c16)
   changed: (rate_value c16) from 5 to 6
   goals met: 10 of 16
54. (increase_rate c16)
   changed: (rate_value c16) from 6 to 7
   goals met: 10 of 16
55. (increase_rate c16)
   changed: (rate_value c16) from 7 to 8
   goals met: 10 of 16
56. (increment c16)
   changed: (value c16) from 51 to 59
   goals met: 10 of 16
57. (increment c16)
   changed: (value c16) from 59 to 67
   goals met: 10 of 16
58. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 10 of 16
59. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 10 of 16
60. (increment c16)
   changed: (value c16) from 67 to 75
   goals met: 10 of 16
61. (increase_rate c16)
   changed: (rate_value c16) from 8 to 9
   goals met: 10 of 16
62. (increase_rate c16)
   changed: (rate_value c16) from 9 to 10
   goals met: 10 of 16
63. (increment c16)
   changed: (value c16) from 75 to 85
   goals met: 10 of 16
64. (increment c16)
   changed: (value c16) from 85 to 95
   goals met: 10 of 16
65. (decrement c15)
   changed: (value c15) from 96 to 94
   goals met: 11 of 16
66. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 11 of 16
67. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 11 of 16
68. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 11 of 16
69. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 11 of 16
70. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 11 of 16
71. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 11 of 16
72. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 11 of 16
73. (increment c11)
   changed: (value c11) from 32 to 39
   goals met: 11 of 16
74. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 11 of 16
75. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 11 of 16
76. (increment c11)
   changed: (value c11) from 39 to 48
   goals met: 10 of 16
77. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 10 of 16
78. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 10 of 16
79. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 10 of 16
80. (increment c11)
   changed: (value c11) from 48 to 58
   goals met: 10 of 16
81. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 10 of 16
82. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 10 of 16
83. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 10 of 16
84. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 16
85. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 10 of 16
86. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 10 of 16
87. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 10 of 16
88. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 10 of 16
89. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 10 of 16
90. (increment c9)
   changed: (value c9) from 10 to 19
   goals met: 10 of 16
91. (increment c9)
   changed: (value c9) from 19 to 28
   goals met: 10 of 16
92. (increment c9)
   changed: (value c9) from 28 to 37
   goals met: 10 of 16
93. (increment c9)
   changed: (value c9) from 37 to 46
   goals met: 10 of 16
94. (increment c9)
   changed: (value c9) from 46 to 55
   goals met: 10 of 16
95. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 10 of 16
96. (increment c9)
   changed: (value c9) from 55 to 65
   goals met: 10 of 16
97. (increment c9)
   changed: (value c9) from 65 to 75
   goals met: 11 of 16
98. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 11 of 16
99. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 11 of 16
100. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 11 of 16
101. (increment c5)
   changed: (value c5) from 23 to 31
   goals met: 10 of 16
102. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 10 of 16
103. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 10 of 16
104. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 10 of 16
105. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 10 of 16
106. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 10 of 16
107. (decrement c5)
   changed: (value c5) from 31 to 21
   goals met: 11 of 16
108. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 11 of 16
109. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 11 of 16
110. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 11 of 16
111. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 11 of 16
112. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 11 of 16
113. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 11 of 16
114. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 11 of 16
115. (decrement c10)
   changed: (value c10) from 81 to 76
   goals met: 11 of 16
116. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 11 of 16
117. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 11 of 16
118. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 11 of 16
119. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 11 of 16
120. (increment c4)
   changed: (value c4) from 52 to 62
   goals met: 11 of 16
121. (increment c3)
   changed: (value c3) from 64 to 74
   goals met: 12 of 16
122. (decrement_rate c4)
   changed: (rate_value c4) from 10 to 9
   goals met: 12 of 16
123. (decrement c4)
   changed: (value c4) from 62 to 53
   goals met: 12 of 16
124. (decrement c4)
   changed: (value c4) from 53 to 44
   goals met: 12 of 16
125. (decrement c4)
   changed: (value c4) from 44 to 35
   goals met: 12 of 16
126. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 12 of 16
127. (increment c5)
   changed: (value c5) from 21 to 31
   goals met: 11 of 16
128. (increment c5)
   changed: (value c5) from 31 to 41
   goals met: 12 of 16
129. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 12 of 16
130. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 12 of 16
131. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 12 of 16
132. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 12 of 16
133. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 12 of 16
134. (increment c6)
   changed: (value c6) from 24 to 30
   goals met: 12 of 16
135. (increment c6)
   changed: (value c6) from 30 to 36
   goals met: 12 of 16
136. (increment c6)
   changed: (value c6) from 36 to 42
   goals met: 13 of 16
137. (increment c4)
   changed: (value c4) from 35 to 45
   goals met: 12 of 16
138. (increment c5)
   changed: (value c5) from 41 to 51
   goals met: 12 of 16
139. (increment c6)
   changed: (value c6) from 42 to 48
   goals met: 12 of 16
140. (increment c6)
   changed: (value c6) from 48 to 54
   goals met: 13 of 16
141. (increment c4)
   changed: (value c4) from 45 to 55
   goals met: 12 of 16
142. (increment c5)
   changed: (value c5) from 51 to 61
   goals met: 12 of 16
143. (increment c6)
   changed: (value c6) from 54 to 60
   goals met: 12 of 16
144. (increment c6)
   changed: (value c6) from 60 to 66
   goals met: 13 of 16
145. (increment c12)
   changed: (value c12) from 46 to 49
   goals met: 12 of 16
146. (increment c12)
   changed: (value c12) from 49 to 52
   goals met: 12 of 16
147. (increment c12)
   changed: (value c12) from 52 to 55
   goals met: 12 of 16
148. (increment c11)
   changed: (value c11) from 58 to 68
   goals met: 12 of 16
149. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 12 of 16
150. (increment c12)
   changed: (value c12) from 55 to 59
   goals met: 12 of 16
151. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 12 of 16
152. (increment c13)
   changed: (value c13) from 47 to 54
   goals met: 11 of 16
153. (increment c13)
   changed: (value c13) from 54 to 61
   goals met: 12 of 16
154. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 12 of 16
155. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 12 of 16
156. (increment c12)
   changed: (value c12) from 59 to 63
   goals met: 11 of 16
157. (increment c13)
   changed: (value c13) from 61 to 70
   goals met: 12 of 16
158. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 12 of 16
159. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 12 of 16
160. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 12 of 16
161. (increment c14)
   changed: (value c14) from 53 to 56
   goals met: 12 of 16
162. (increment c14)
   changed: (value c14) from 56 to 59
   goals met: 12 of 16
163. (increment c14)
   changed: (value c14) from 59 to 62
   goals met: 12 of 16
164. (decrement c13)
   changed: (value c13) from 70 to 61
   goals met: 12 of 16
165. (decrement c12)
   changed: (value c12) from 63 to 59
   goals met: 13 of 16
166. (increment c11)
   changed: (value c11) from 68 to 78
   goals met: 14 of 16
167. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 14 of 16
168. (increment c12)
   changed: (value c12) from 59 to 64
   goals met: 13 of 16
169. (increment c13)
   changed: (value c13) from 61 to 70
   goals met: 13 of 16
170. (increment c14)
   changed: (value c14) from 62 to 65
   goals met: 13 of 16
171. (increment c14)
   changed: (value c14) from 65 to 68
   goals met: 13 of 16
172. (increment c14)
   changed: (value c14) from 68 to 71
   goals met: 14 of 16
173. (increment c12)
   changed: (value c12) from 64 to 69
   goals met: 14 of 16
174. (increment c12)
   changed: (value c12) from 69 to 74
   goals met: 13 of 16
175. (increment c13)
   changed: (value c13) from 70 to 79
   goals met: 13 of 16
176. (increment c14)
   changed: (value c14) from 71 to 74
   goals met: 13 of 16
177. (increment c14)
   changed: (value c14) from 74 to 77
   goals met: 13 of 16
178. (increment c14)
   changed: (value c14) from 77 to 80
   goals met: 14 of 16
179. (increment c12)
   changed: (value c12) from 74 to 79
   goals met: 14 of 16
180. (increment c13)
   changed: (value c13) from 79 to 88
   goals met: 14 of 16
181. (increment c14)
   changed: (value c14) from 80 to 83
   goals met: 14 of 16
182. (increment c14)
   changed: (value c14) from 83 to 86
   goals met: 14 of 16
183. (increment c14)
   changed: (value c14) from 86 to 89
   goals met: 15 of 16
184. (increment c4)
   changed: (value c4) from 55 to 65
   goals met: 14 of 16
185. (increment c5)
   changed: (value c5) from 61 to 71
   goals met: 14 of 16
186. (increment c6)
   changed: (value c6) from 66 to 72
   goals met: 14 of 16
187. (decrement c3)
   changed: (value c3) from 74 to 64
   goals met: 14 of 16
188. (decrement c2)
   changed: (value c2) from 73 to 70
   goals met: 13 of 16
189. (decrement c2)
   changed: (value c2) from 70 to 67
   goals met: 13 of 16
190. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 13 of 16
191. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 13 of 16
192. (decrement c2)
   changed: (value c2) from 67 to 63
   goals met: 14 of 16
193. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 14 of 16
194. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 14 of 16
195. (decrement c1)
   changed: (value c1) from 71 to 68
   goals met: 14 of 16
196. (decrement c1)
   changed: (value c1) from 68 to 65
   goals met: 14 of 16
197. (decrement c1)
   changed: (value c1) from 65 to 62
   goals met: 15 of 16
198. (decrement c6)
   changed: (value c6) from 72 to 66
   goals met: 15 of 16
199. (decrement c5)
   changed: (value c5) from 71 to 61
   goals met: 15 of 16
200. (decrement c4)
   changed: (value c4) from 65 to 55
   goals met: 15 of 16
201. (decrement c3)
   changed: (value c3) from 64 to 54
   goals met: 15 of 16
202. (decrement c2)
   changed: (value c2) from 63 to 59
   goals met: 14 of 16
203. (decrement c2)
   changed: (value c2) from 59 to 55
   goals met: 14 of 16
204. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 14 of 16
205. (decrement c2)
   changed: (value c2) from 55 to 51
   goals met: 15 of 16
206. (decrement c1)
   changed: (value c1) from 62 to 58
   goals met: 15 of 16
207. (decrement c1)
   changed: (value c1) from 58 to 54
   goals met: 15 of 16
208. (decrement c1)
   changed: (value c1) from 54 to 50
   goals met: 16 of 16
